app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
SELECT "join_table_tag_gossips".* FROM "join_table_tag_gossips"
---
  def show
    @gossip = Gossip.find(params[:id])
    @comment = Comment.new
    @tags = JoinTableTagGossip.all.map{|join| join.gossip_id == @gossip.id ? join.tag.title : nil}.compact

SELECT "tags".* FROM "tags"
---
  def new
    @gossip = Gossip.new
    @tag = JoinTableTagGossip.new
    @tags = Tag.all

SELECT "tags".* FROM "tags"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "zgthxjckyu"], ["content", "texyrjuftkyil"], ["user_id", 33], ["created_at", "2020-02-12 21:31:25.460757"], ["updated_at", "2020-02-12 21:31:25.460757"]]
INSERT INTO "join_table_tag_gossips" ("tag_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 29], ["gossip_id", 80], ["created_at", "2020-02-12 21:31:25.474845"], ["updated_at", "2020-02-12 21:31:25.474845"]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 80], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
INSERT INTO "join_table_tag_gossips" ("tag_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 28], ["gossip_id", 76], ["created_at", "2020-02-12 20:56:27.718934"], ["updated_at", "2020-02-12 20:56:27.718934"]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "azertyuiop"], ["content", "âzertyuiop"], ["user_id", 33], ["created_at", "2020-02-12 20:56:27.696669"], ["updated_at", "2020-02-12 20:56:27.696669"]]
---
  def create
    @tags = Tag.all
    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: params[:user])
    if @gossip.save && params[:tag] != ""
      @tag = JoinTableTagGossip.create(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id)
      render :index
    elsif @gossip.save && params[:tag] == ""

SELECT "tags".* FROM "tags"
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def edit
    @tags = Tag.all
    @gossip = Gossip.find(params[:id])

SELECT  "join_table_tag_gossips".* FROM "join_table_tag_gossips" WHERE "join_table_tag_gossips"."gossip_id" = $1 LIMIT $2  [["gossip_id", 82], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3
UPDATE "join_table_tag_gossips" SET "tag_id" = $1, "gossip_id" = $2, "updated_at" = $3 WHERE "join_table_tag_gossips"."id" = $4  [["tag_id", 28], ["gossip_id", 51], ["updated_at", "2020-02-12 21:19:56.327732"], ["id", 94]]
INSERT INTO "join_table_tag_gossips" ("tag_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 25], ["gossip_id", 82], ["created_at", "2020-02-12 21:41:00.460071"], ["updated_at", "2020-02-12 21:41:00.460071"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
---
  def update
    show
    @tag = JoinTableTagGossip.find_by(gossip_id: @gossip.id)
    if @gossip.update(title: params[:title], content: params[:content])
      if params[:tag] == "" && @tag = nil
        puts params
        render :show
      else
        @tag != nil ? @tag.update(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id) : JoinTableTagGossip.create(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 52]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    if @gossip.destroy